<h1> Name: Eshan Mehrotra

In [199]:
import pandas as pd

In [200]:
data = {'Name':['Jack','Jill','Jack','Bob','Jill','Jack','Bob','Jill'],
         'Exam': ['e1','e1','e2','e1','e3','e1','e3','e3'],
          'Score': [92,96,83,97,86,98,99,97]}
datadf = pd.DataFrame(data)
datadf

   Name Exam  Score
0  Jack   e1     92
1  Jill   e1     96
2  Jack   e2     83
3   Bob   e1     97
4  Jill   e3     86
5  Jack   e1     98
6   Bob   e3     99
7  Jill   e3     97

## My Pivot Table Function

In [210]:
def my_pivot_table(df, index, columns, values, aggfunc=lambda s: s.mean()):
    '''
    Create a spreadsheet-style pivot table as a DataFrame.
    There will be only 1 level in the pivot table
    based on the index and columns of the input DataFrame.

    Parameters
    ----------
    data : DataFrame
    values : column to aggregate, optional
    index : column, Grouper, array, or list of the previous
    columns : column, Grouper, array, or list of the previous
    aggfunc : function, list of functions, dict, default numpy.mean
        If dict is passed, the key is column to aggregate and value
        is function or list of functions.
        
    Returns
    -------
    DataFrame
        An Excel style pivot table.
        
    Type: function
    '''
    newdf = pd.DataFrame(columns=sorted(df[columns].unique()),
                           index=sorted(df[index].unique()))
    
    for idx,row in df.iterrows():
        val = df[(df[index]==row[index]) & (df[columns]==row[columns])][values].to_frame().apply(aggfunc)[0]
        newdf.loc[row[index],row[columns]] = val
    
    
    return newdf.rename_axis(index).rename_axis(columns,axis='columns')

## Pandas Pivot Table Expected Output

In [211]:
pd.pivot_table(datadf,index='Name',columns='Exam',values='Score',aggfunc=lambda s:s.mean())

Exam    e1    e2    e3
Name
Bob   97.0   NaN  99.0
Jack  95.0  83.0   NaN
Jill  96.0   NaN  91.5

## My Pivot Table Function Output

In [219]:
mydf = my_pivot_table(datadf,index='Name',columns='Exam',values='Score')
mydf

Exam    e1    e2    e3
Name
Bob   97.0   NaN  99.0
Jack  95.0  83.0   NaN
Jill  96.0   NaN  91.5

In [218]:
mydf = my_pivot_table(datadf,index='Name',columns='Exam',values='Score',aggfunc=lambda s:s.count())
mydf

Exam e1   e2   e3
Name
Bob   1  NaN    1
Jack  2    1  NaN
Jill  1  NaN    2